In [2]:
# loading libraries and reading the data
import numpy as np
import pandas as pd

market_df = pd.read_csv("./global_sales_data/market_fact.csv")
customer_df = pd.read_csv("./global_sales_data/cust_dimen.csv")
product_df = pd.read_csv("./global_sales_data/prod_dimen.csv")
shipping_df = pd.read_csv("./global_sales_data/shipping_dimen.csv")
orders_df = pd.read_csv("./global_sales_data/orders_dimen.csv")

### Merging Dataframes

There are five data files:
1. The ```market_fact``` table contains the sales data of each order
2. The other 4 files are called 'dimension tables/files' and contain metadata about customers, products, shipping details, order details etc.

In [ ]:
market_df.head()

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56
1,Ord_5406,Prod_13,SHP_7549,Cust_1818,42.27,0.01,13,4.56,0.93,0.54
2,Ord_5446,Prod_4,SHP_7610,Cust_1818,4701.69,0.00,26,1148.90,2.50,0.59
3,Ord_5456,Prod_6,SHP_7625,Cust_1818,2337.89,0.09,43,729.34,14.30,0.37
4,Ord_5485,Prod_17,SHP_7664,Cust_1818,4233.15,0.08,35,1219.87,26.30,0.38

In [3]:
market_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8399 entries, 0 to 8398
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Ord_id               8399 non-null   object
 1   Prod_id              8399 non-null   object
 2   Ship_id              8399 non-null   object
 3   Cust_id              8399 non-null   object
 4   Sales                8399 non-null   float64
 5   Discount             8399 non-null   float64
 6   Order_Quantity       8399 non-null   int64
 7   Profit               8399 non-null   float64
 8   Shipping_Cost        8399 non-null   float64
 9   Product_Base_Margin  8336 non-null   float64
dtypes: float64(5), int64(1), object(4)
memory usage: 656.3+ KB

In [4]:
# Customer dimension table: Each row contains metadata about customers
customer_df.head()

        Customer_Name Province   Region Customer_Segment Cust_id
0  MUHAMMED MACINTYRE  NUNAVUT  NUNAVUT   SMALL BUSINESS  Cust_1
1        BARRY FRENCH  NUNAVUT  NUNAVUT         CONSUMER  Cust_2
2       CLAY ROZENDAL  NUNAVUT  NUNAVUT        CORPORATE  Cust_3
3      CARLOS SOLTERO  NUNAVUT  NUNAVUT         CONSUMER  Cust_4
4        CARL JACKSON  NUNAVUT  NUNAVUT        CORPORATE  Cust_5

In [5]:
# Product dimension table
product_df.head()

  Product_Category            Product_Sub_Category Prod_id
0  OFFICE SUPPLIES          STORAGE & ORGANIZATION  Prod_1
1  OFFICE SUPPLIES                      APPLIANCES  Prod_2
2  OFFICE SUPPLIES  BINDERS AND BINDER ACCESSORIES  Prod_3
3       TECHNOLOGY    TELEPHONES AND COMMUNICATION  Prod_4
4        FURNITURE              OFFICE FURNISHINGS  Prod_5

In [6]:
# Shipping metadata
shipping_df.head()

   Order_ID       Ship_Mode   Ship_Date Ship_id
0         3     REGULAR AIR  20-10-2010   SHP_1
1       293  DELIVERY TRUCK  02-10-2012   SHP_2
2       293     REGULAR AIR  03-10-2012   SHP_3
3       483     REGULAR AIR  12-07-2011   SHP_4
4       515     REGULAR AIR  30-08-2010   SHP_5

In [7]:
# Orders dimension table
orders_df.head()

   Order_ID  Order_Date Order_Priority Ord_id
0         3  13-10-2010            LOW  Ord_1
1       293  01-10-2012           HIGH  Ord_2
2       483  10-07-2011           HIGH  Ord_3
3       515  28-08-2010  NOT SPECIFIED  Ord_4
4       613  17-06-2011           HIGH  Ord_5

### Merging Dataframes

Say you want to select all orders and observe the ```Sales``` of the customer segment *Corporate*. Since customer segment details are present in the dataframe ```customer_df```, we will first need to merge it with ```market_df```.

In [9]:
# Merging the dataframes
# Note that Cust_id is the common column/key, which is provided to the 'on' argument
# how = 'inner' makes sure that only the customer ids present in both dfs are included in the result
df_1 = pd.merge(market_df, customer_df, how='inner', on='Cust_id')
df_1.head()

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56,AARON BERGMAN,ALBERTA,WEST,CORPORATE
1,Ord_5406,Prod_13,SHP_7549,Cust_1818,42.27,0.01,13,4.56,0.93,0.54,AARON BERGMAN,ALBERTA,WEST,CORPORATE
2,Ord_5446,Prod_4,SHP_7610,Cust_1818,4701.69,0.00,26,1148.90,2.50,0.59,AARON BERGMAN,ALBERTA,WEST,CORPORATE
3,Ord_5456,Prod_6,SHP_7625,Cust_1818,2337.89,0.09,43,729.34,14.30,0.37,AARON BERGMAN,ALBERTA,WEST,CORPORATE
4,Ord_5485,Prod_17,SHP_7664,Cust_1818,4233.15,0.08,35,1219.87,26.30,0.38,AARON BERGMAN,ALBERTA,WEST,CORPORATE

In [11]:
# Now, you can subset the orders made by customers from 'CORPORATE' segment
df_1.loc[df_1['Customer_Segment'] == 'CORPORATE', :]

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56,AARON BERGMAN,ALBERTA,WEST,CORPORATE
1,Ord_5406,Prod_13,SHP_7549,Cust_1818,42.27,0.01,13,4.56,0.93,0.54,AARON BERGMAN,ALBERTA,WEST,CORPORATE
2,Ord_5446,Prod_4,SHP_7610,Cust_1818,4701.69,0.00,26,1148.90,2.50,0.59,AARON BERGMAN,ALBERTA,WEST,CORPORATE
3,Ord_5456,Prod_6,SHP_7625,Cust_1818,2337.89,0.09,43,729.34,14.30,0.37,AARON BERGMAN,ALBERTA,WEST,CORPORATE
4,Ord_5485,Prod_17,SHP_7664,Cust_1818,4233.15,0.08,35,1219.87,26.30,0.38,AARON BERGMAN,ALBERTA,WEST,CORPORATE
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8385,Ord_1833,Prod_3,SHP_2527,Cust_637,611.16,0.04,46,100.22,4.98,0.40,YANA SORENSEN,NEWFOUNDLAND,ATLANTIC,CORPORATE
8386,Ord_2324,Prod_7,SHP_3189,Cust_851,121.87,0.07,39,11.32,1.35,0.40,YANA SORENSEN,QUEBEC,QUEBEC,CORPORATE
8387,Ord_2220,Prod_3,SHP_3019,Cust_851,41.06,0.04,4,-16.39,6.28,0.35,YANA SORENSEN,QUEBEC,QUEBEC,CORPORATE
8388,Ord_4424,Prod_1,SHP_6165,Cust_1519,994.04,0.03,10,-335.06,35.00,NaN,YANA SORENSEN,YUKON,YUKON,CORPORATE
8389,Ord_4444,Prod_13,SHP_6192,Cust_1519,159.41,0.00,44,34.68,0.98,0.52,YANA SORENSEN,YUKON,YUKON,CORPORATE

In [13]:
# Example 2: Select all orders from product category = office supplies and from the corporate segment
# We now need to merge the product_df

df_2 = pd.merge(df_1, product_df, how='inner', on='Prod_id')
df_2.head()

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment,Product_Category,Product_Sub_Category
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56,AARON BERGMAN,ALBERTA,WEST,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
1,Ord_2978,Prod_16,SHP_4112,Cust_1088,305.05,0.04,27,23.12,3.37,0.57,AARON HAWKINS,ONTARIO,ONTARIO,HOME OFFICE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
2,Ord_5484,Prod_16,SHP_7663,Cust_1820,322.82,0.05,35,-17.58,3.98,0.56,ADRIAN SHAMI,ALBERTA,WEST,CONSUMER,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
3,Ord_3730,Prod_16,SHP_5175,Cust_1314,459.08,0.04,34,61.57,3.14,0.60,ALEKSANDRA GANNAWAY,SASKACHEWAN,PRARIE,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
4,Ord_4143,Prod_16,SHP_5771,Cust_1417,207.21,0.06,24,-78.64,6.14,0.59,ALLEN ARMOLD,NEW BRUNSWICK,ATLANTIC,HOME OFFICE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"

In [16]:
df_2.loc[df_2['Customer_Segment']=='CORPORATE']

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment,Product_Category,Product_Sub_Category
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56,AARON BERGMAN,ALBERTA,WEST,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
3,Ord_3730,Prod_16,SHP_5175,Cust_1314,459.08,0.04,34,61.57,3.14,0.60,ALEKSANDRA GANNAWAY,SASKACHEWAN,PRARIE,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
7,Ord_4506,Prod_16,SHP_6273,Cust_1544,92.02,0.07,9,-24.88,4.68,0.59,AMY COX,YUKON,YUKON,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
9,Ord_1551,Prod_16,SHP_2145,Cust_531,184.77,0.00,29,-71.96,5.30,0.55,ANDY YOTOV,ONTARIO,ONTARIO,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
11,Ord_1429,Prod_16,SHP_1976,Cust_510,539.06,0.05,42,-123.07,4.59,0.82,ANNA HABERLIN,ONTARIO,ONTARIO,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8384,Ord_1265,Prod_14,SHP_1749,Cust_466,24051.49,0.07,41,9791.04,24.49,0.37,RITSA HIGHTOWER,ONTARIO,ONTARIO,CORPORATE,TECHNOLOGY,COPIERS AND FAX
8385,Ord_669,Prod_14,SHP_916,Cust_224,20872.16,0.03,29,-4437.91,24.49,0.41,ROY SKARIA,BRITISH COLUMBIA,WEST,CORPORATE,TECHNOLOGY,COPIERS AND FAX
8386,Ord_171,Prod_14,SHP_231,Cust_1194,6350.29,0.02,10,-735.97,24.49,0.50,ROY SKARIA,MANITOBA,PRARIE,CORPORATE,TECHNOLOGY,COPIERS AND FAX
8387,Ord_1390,Prod_14,SHP_1919,Cust_537,6933.45,0.04,15,1200.21,49.00,0.38,RUBEN AUSMAN,ONTARIO,ONTARIO,CORPORATE,TECHNOLOGY,COPIERS AND FAX
8398,Ord_3610,Prod_14,SHP_4998,Cust_1266,1759.65,0.06,3,-2213.75,24.49,0.50,WILLIAM BROWN,SASKACHEWAN,PRARIE,CORPORATE,TECHNOLOGY,COPIERS AND FAX

In [17]:
# Select all orders from product category = FURNITURE and from the consumer segment
df_2.loc[(df_2['Product_Category']=='FURNITURE') & (df_2['Customer_Segment']=='CONSUMER'),:]

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,Customer_Name,Province,Region,Customer_Segment,Product_Category,Product_Sub_Category
3947,Ord_2340,Prod_11,SHP_3211,Cust_933,2907.63,0.04,42,54.60,69.00,0.68,ALAN HAINES,QUEBEC,QUEBEC,CONSUMER,FURNITURE,TABLES
3950,Ord_2791,Prod_11,SHP_3838,Cust_1036,10351.01,0.08,19,-1331.55,45.70,0.71,ALEJANDRO GROVE,ONTARIO,ONTARIO,CONSUMER,FURNITURE,TABLES
3972,Ord_2116,Prod_11,SHP_2892,Cust_783,8246.86,0.06,46,-433.29,29.21,0.74,BARRY GONZALEZ,QUEBEC,QUEBEC,CONSUMER,FURNITURE,TABLES
3997,Ord_2059,Prod_11,SHP_2815,Cust_776,1875.18,0.01,10,-433.29,29.21,0.74,BRIAN STUGART,NOVA SCOTIA,ATLANTIC,CONSUMER,FURNITURE,TABLES
3998,Ord_2059,Prod_11,SHP_2815,Cust_918,3587.72,0.00,47,54.23,89.30,0.69,BRIAN STUGART,QUEBEC,QUEBEC,CONSUMER,FURNITURE,TABLES
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5894,Ord_4974,Prod_15,SHP_6944,Cust_1693,4252.89,0.06,20,969.42,18.06,0.57,TIM BROCKMAN,ALBERTA,WEST,CONSUMER,FURNITURE,CHAIRS & CHAIRMATS
5896,Ord_1686,Prod_15,SHP_2331,Cust_581,19342.84,0.01,39,5603.95,126.00,0.60,TODD BOYES,ONTARIO,ONTARIO,CONSUMER,FURNITURE,CHAIRS & CHAIRMATS
5897,Ord_2728,Prod_15,SHP_3739,Cust_1035,1225.37,0.08,9,0.98,24.49,0.57,TODD SUMRALL,ONTARIO,ONTARIO,CONSUMER,FURNITURE,CHAIRS & CHAIRMATS
5903,Ord_3368,Prod_15,SHP_4668,Cust_1190,3227.38,0.05,26,192.31,30.00,0.64,TRACY ZIC,MANITOBA,PRARIE,CONSUMER,FURNITURE,CHAIRS & CHAIRMATS
5913,Ord_5348,Prod_15,SHP_7469,Cust_1798,3872.87,0.03,23,565.34,30.00,0.62,YOSEPH CARROLL,ALBERTA,WEST,CONSUMER,FURNITURE,CHAIRS & CHAIRMATS


Similary, you can merge the other dimension tables - ```shipping_df``` and ```orders_df``` to create a ```master_df``` and perform indexing using any column in the master dataframe.

In [19]:
master_df = pd.merge(shipping_df,orders_df,how='inner',on='Order_ID')
master_df.head()

,Order_ID,Ship_Mode,Ship_Date,Ship_id,Order_Date,Order_Priority,Ord_id
0,3,REGULAR AIR,20-10-2010,SHP_1,13-10-2010,LOW,Ord_1
1,293,DELIVERY TRUCK,02-10-2012,SHP_2,01-10-2012,HIGH,Ord_2
2,293,REGULAR AIR,03-10-2012,SHP_3,01-10-2012,HIGH,Ord_2
3,483,REGULAR AIR,12-07-2011,SHP_4,10-07-2011,HIGH,Ord_3
4,515,REGULAR AIR,30-08-2010,SHP_5,28-08-2010,NOT SPECIFIED,Ord_4

In [21]:
# Merging shipping_df
df_3 = pd.merge(df_2, shipping_df, how='inner', on='Ship_id')
df_3.shape

(8399, 19)

In [22]:
# Merging the orders table to create a master df
master_df = pd.merge(df_3, orders_df, how='inner', on='Ord_id')
master_df.shape
#master_df.head()

(8399, 22)

In [23]:
master_df.head()

,Ord_id,Prod_id,Ship_id,Cust_id,Sales,Discount,Order_Quantity,Profit,Shipping_Cost,Product_Base_Margin,...,Region,Customer_Segment,Product_Category,Product_Sub_Category,Order_ID_x,Ship_Mode,Ship_Date,Order_ID_y,Order_Date,Order_Priority
0,Ord_5446,Prod_16,SHP_7609,Cust_1818,136.81,0.01,23,-30.51,3.60,0.56,...,WEST,CORPORATE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS",36262,REGULAR AIR,28-07-2010,36262,27-07-2010,NOT SPECIFIED
1,Ord_5446,Prod_4,SHP_7610,Cust_1818,4701.69,0.00,26,1148.90,2.50,0.59,...,WEST,CORPORATE,TECHNOLOGY,TELEPHONES AND COMMUNICATION,36262,EXPRESS AIR,27-07-2010,36262,27-07-2010,NOT SPECIFIED
2,Ord_5446,Prod_6,SHP_7608,Cust_1818,164.02,0.03,23,-47.64,6.15,0.37,...,WEST,CORPORATE,OFFICE SUPPLIES,PAPER,36262,EXPRESS AIR,28-07-2010,36262,27-07-2010,NOT SPECIFIED
3,Ord_2978,Prod_16,SHP_4112,Cust_1088,305.05,0.04,27,23.12,3.37,0.57,...,ONTARIO,HOME OFFICE,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS",37863,REGULAR AIR,26-02-2011,37863,24-02-2011,HIGH
4,Ord_5484,Prod_16,SHP_7663,Cust_1820,322.82,0.05,35,-17.58,3.98,0.56,...,WEST,CONSUMER,OFFICE SUPPLIES,"SCISSORS, RULERS AND TRIMMERS",53026,REGULAR AIR,03-03-2012,53026,26-02-2012,LOW

Similary, you can perform left, right and outer merges (joins) by using the argument ```how = 'left' / 'right' / 'outer'```.

### Concatenating Dataframes

#### Concatenating Dataframes Having the Same columns

In [25]:
# dataframes having the same columns
# write the names, age  and gender
df1 = pd.DataFrame({'Name': ['Pankaj','Uday','Amit','Anuj'],
                    'Age': [20,20,20,20],
                    'Gender': ['M','M','M','M']}
                  )

df2 = pd.DataFrame({'Name': ['Akshansh','Rohit','Kartikey'],
                    'Age': [19,19,19],
                    'Gender': ['M','M','M']}
                  )
df1

     Name  Age Gender
0  Pankaj   20      M
1    Uday   20      M
2    Amit   20      M
3    Anuj   20      M

In [26]:
df2

       Name  Age Gender
0  Akshansh   19      M
1     Rohit   19      M
2  Kartikey   19      M

In [27]:
# To concatenate them, one on top of the other, you can use pd.concat
# The first argument is a sequence (list) of dataframes
# axis = 0 indicates that we want to concat along the row axis
pd.concat([df1, df2], axis = 0)

       Name  Age Gender
0    Pankaj   20      M
1      Uday   20      M
2      Amit   20      M
3      Anuj   20      M
0  Akshansh   19      M
1     Rohit   19      M
2  Kartikey   19      M

In [28]:
# A useful and intuitive alternative to concat along the rows is the append() function
# It concatenates along the rows
df1.append(df2)

C:\Users\suraj.kurde\AppData\Local\Temp\ipykernel_19936\132225679.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

       Name  Age Gender
0    Pankaj   20      M
1      Uday   20      M
2      Amit   20      M
3      Anuj   20      M
0  Akshansh   19      M
1     Rohit   19      M
2  Kartikey   19      M

#### Concatenating Dataframes Having the Same Rows

You may also have dataframes having the same rows but different columns (and having no common columns). In this case, you may want to concat them side-by-side. For e.g.:

In [ ]:
# add the name, age and gender before executing
df1 = pd.DataFrame({'Name': [<4 names from class>],
                    'Age': [<their age>],
                    'Gender': [<their gender in 'M', 'F' format>]}
                  )
df1

     Name Age Gender
0    Aman  34      M
1     Joy  31      M
2  Rashmi  22      F
3    Saif  33      M

In [30]:
df1

     Name  Age Gender
0  Pankaj   20      M
1    Uday   20      M
2    Amit   20      M
3    Anuj   20      M

In [29]:
df2 = pd.DataFrame({'School': ['MUIT','MUIT','MUIT','MUIT'],
                    'Marks': [80,81.23,89.97,92.27]}
                  )
df2

  School  Marks
0   MUIT  80.00
1   MUIT  81.23
2   MUIT  89.97
3   MUIT  92.27

In [31]:
# To join the two dataframes, use axis = 1 to indicate joining along the columns axis
# The join is possible because the corresponding rows have the same indices
pd.concat([df1, df2], axis = 1)

     Name  Age Gender School  Marks
0  Pankaj   20      M   MUIT  80.00
1    Uday   20      M   MUIT  81.23
2    Amit   20      M   MUIT  89.97
3    Anuj   20      M   MUIT  92.27

Note that you can also use the ```pd.concat()``` method to merge dataframes using common keys, though here we will not discuss that. For simplicity, we have used the ```pd.merge()``` method for database-style merging and ```pd.concat()``` for appending dataframes having no common columns.

#### Performing Arithmetic Operations on two or more dataframes

We can also perform simple arithmetic operations on two or more dataframes. Below are the stats for IPL 2018 and 2017.

In [32]:
# Teamwise stats for IPL 2018
IPL_2019 = pd.DataFrame({'IPL Team': ['MI','CSK','PBK','SRH'],
                         'Matches Played': [30,28,28,25],
                         'Matches Won': [28,27,20,15]}
                       )

# Set the 'IPL Team' column as the index to perform arithmetic operations on the other rows using the team as reference
IPL_2019.set_index('IPL Team', inplace = True)
IPL_2019

          Matches Played  Matches Won
IPL Team
MI                    30           28
CSK                   28           27
PBK                   28           20
SRH                   25           15

In [33]:
# Similarly, we have the stats for IPL 2017 add the information accordingly before executing
IPL_2018 = pd.DataFrame({'IPL Team': ['MI','CSK','LSG','KKR','RR'],
                         'Matches Played': [17,16,16,15,14],
                         'Matches Won': [14,15,13,10,7]}
                       )
IPL_2018.set_index('IPL Team', inplace = True)
IPL_2018

          Matches Played  Matches Won
IPL Team
MI                    17           14
CSK                   16           15
LSG                   16           13
KKR                   15           10
RR                    14            7

In [34]:
# Simply add the two DFs using the add opearator

Total = IPL_2019 + IPL_2018
Total

          Matches Played  Matches Won
IPL Team
CSK                 44.0         42.0
KKR                  NaN          NaN
LSG                  NaN          NaN
MI                  47.0         42.0
PBK                  NaN          NaN
RR                   NaN          NaN
SRH                  NaN          NaN

Notice that there are a lot of NaN values. This is because some teams which played in IPL 2018 were not present in IPL 2019. In addition, there were also new teams present in IPL 2019. We can handle these NaN values by using `df.add()` instead of the simple add operator.

In [35]:
# The fill_value argument inside the df.add() function replaces all the NaN values in the two dataframes w.r.t. each other with zero.
Total = IPL_2019.add(IPL_2018, fill_value = 0)
Total

          Matches Played  Matches Won
IPL Team
CSK                 44.0         42.0
KKR                 15.0         10.0
LSG                 16.0         13.0
MI                  47.0         42.0
PBK                 28.0         20.0
RR                  14.0          7.0
SRH                 25.0         15.0

Also notice how the resultant dataframe is sorted by the index, i.e. 'IPL Team' alphabetically.

In [36]:
# Creating a new column - 'Win Percentage'

Total['Win Percentage'] = Total['Matches Won']/Total['Matches Played']
Total

          Matches Played  Matches Won  Win Percentage
IPL Team
CSK                 44.0         42.0        0.954545
KKR                 15.0         10.0        0.666667
LSG                 16.0         13.0        0.812500
MI                  47.0         42.0        0.893617
PBK                 28.0         20.0        0.714286
RR                  14.0          7.0        0.500000
SRH                 25.0         15.0        0.600000

In [37]:
# Sorting to determine the teams with most number of wins. If the number of wins of two teams are the same, sort by the win percentage.

Total.sort_values(by = (['Matches Won', 'Win Percentage']), ascending = False)

          Matches Played  Matches Won  Win Percentage
IPL Team
CSK                 44.0         42.0        0.954545
MI                  47.0         42.0        0.893617
PBK                 28.0         20.0        0.714286
SRH                 25.0         15.0        0.600000
LSG                 16.0         13.0        0.812500
KKR                 15.0         10.0        0.666667
RR                  14.0          7.0        0.500000

Apart from add(), there are also other operator-equivalent mathematical functions that you can use on Dataframes. Below is a list of all the functions that you can use to perform operations on two or more dataframes
-  `add()`: +
-  `sub()`: -
-  `mul()`: *
-  `div()`: /
-  `floordiv()`: //
-  `mod()`: %
-  `pow()`: **